 [
    {
        "url":"img/exegol2.png",
        "title":"The Battle Of Exegol",
        "date":"21/12/35 ABY",
        "desc":"Rey arrives on Exegol and transmits her location to the Resistance. She confronts Palpatine and the Sith Eternal, who demands that she kill him to transfer his spirit into Rey. The Resistance engages in battle with the Sith Lord's fleet, though they are overpowered, suffering losses like Temmin Wexley. Ben overpowers the Knights of Ren and arrives to help Rey, but Palpatine rejuvenates himself by absorbing the life essences of Rey and Ben and then disables the Resistance fleet above with Force lightning. Palpatine tells Ben that he will be the last Skywalker and uses the Force to throw him into a nearby chasm, seemingly killing him. Palpatine furiously attempts to destroy Rey with lightning, but she deflects it back towards him using the two lightsabers, disintegrating his body and killing him once and for all. However, Rey dies from the effort of the powerful attack."
    },{
        "url":"img/kif-bir.jpg",
        "title":"Kylo Ren on Kef Bir",
        "date":"18/12/35 ABY",
        "desc":"Kylo, having tracked the group to Kef Bir, finds and destroys the wayfinder in an attempt to channel her anger, thus dueling Rey. Ren, however, gets the upper hand, but as a dying Leia calls to Kylo by his name Ben through the Force, Rey impales him. Sensing Leia's death, Rey heals Kylo and takes his TIE whisper to exile herself to Ahch-To, shaken by her Sith lineage."
    },{
        "url":"img/pryde2.jpg",
        "title":"General Enric Pryde Becomes new High Command",
        "date":"17/12/35 ABY",
        "desc":"When it appears that all is lost for Finn, Poe, and Chewie, who have been captured by the First Order, General Hux arrives and surprisingly not only allows them to escape but points them in the direction of the Falcon. Hux was the mole within the First Order that Finn and Poe had received information from. When asked, he tells them that he wasn't doing it to help the Resistance, but rather because he didn't want Kylo Ren to win. Ren arrives and faces off Rey, in which he reveals that she is Palpatine's granddaughter; her father was the son of the Emperor. He also reveals that they are a dyad in the Force, two that are one in the Force. Then, Kylo once again offers for Rey to join him, but she refuses, escaping in the Falcon. After they leave, Pryde kills Hux for treason against the First Order and assumes control of the First Order military. Palpatine contacts Pryde and demands that he use one of the specially equipped Star Destroyers to destroy Kijimi as an act of loyalty and Pryde complies. Pryde tells Kylo that even though they don't have the dagger, they know where the Resistance is going because they scanned it while it was still in their possession."
    },{
        "url":"img/emp-palp.jpg",
        "title":"Palpatine Returns?! Emperor's voice broadcast across Galaxy",
        "date":"13/08/35 ABY",
        "desc":"\"At last the work of generations is complete. The great error is corrected. The day of victory is at hand. The day of revenge. The day of the Sith.\" <br> Palpatine's broadcast was an audio message of revenge delivered to the galaxy in the year 35 ABY. Prepared for conquest of the galaxy following his death at the Battle of Endor, Emperor Palpatine announced his revival via this broadcast, publicly declaring his intention for revenge and the return of the Sith. Subsequently, First Order Supreme Leader Kylo Ren undertook a mission to Mustafar in search of a path to the resurrected Sith Lord, seeking to confront this threat and secure his power."
    },{
        "url":"img/luke-sky.jpg",
        "title":"Kylo Ren Avenges the death of Emperor and Darth Vader",
        "date":"19/12/34 ABY",
        "desc":"As the Resistance contemplated their next move, Luke Skywalker unexpectedly appeared to the group and resolved to go out to face the First Order on his own as a distraction. As Skywalker emerged from the base, Ren ordered all of the walkers to open fire on Skywalker in a futile attempt to destroy him. However, the Jedi Master miraculously emerged unscathed, and Ren felt the need to go down to the surface and face his old master himself, despite Hux's advice to the contrary. In a brief confrontation, Skywalker dodged Ren's lightsaber attacks. When Skywalker allowed Ren to land a blow, and the blade passed through his body without harming him, Ren realized that he was actually fighting a Force projection of the Jedi, who was still on Ahch-To. Skywalker's projection vanished. Unable to feel Skywalker's life force, Ren was assured he had successfully defeated and avenged his predecessors. The resistence was able to escape, but the First Order will continue to track these traitors."
    },{
        "url":"img/supremacy.jpg",
        "title":"Battle of Crait",
        "date":"19/12/34 ABY",
        "desc":"he Battle of Crait, also known as the siege of Crait, was a major battle fought in 34 ABY during the war between the First Order and the Resistance. Shortly after the Resistance's victory at Starkiller Base, the Battle of Crait was the result of the First Order's counterattack, which had decimated the Resistance forces. Unable to escape the First Order Navy, the Resistance, led by General Leia Organa, fled to a former Rebel outpost on the salt-covered planet Crait, hoping to go unnoticed. However, the First Order became aware of the Resistance's plan and deployed their military forces to the planet's surface. <br>Led by the newly self-appointed Supreme Leader Kylo Ren and General Armitage Hux, the First Order deployed a superlaser siege cannon, planning to break through the massive door which protected the outpost. The Resistance, limited in numbers, had planned to hold out in the base until more allies arrived, but in response to the First Order cannon, the remaining Resistance troops utilized V-4X-D ski speeders to attack the weapon. The Resistance airspeeders faced many losses against the TIE/fo space superiority fighters of the First Order, but when the light freighter Millennium Falcon arrived to help the Resistance, Ren redirected the TIE fighters to pursue the starship. Although the Resistance ski speeders were no longer targeted by the TIE fighters, their efforts were unsuccessful, and the siege cannon fired upon the outpost."
    },{
        "url":"img/snoke.jpeg",
        "title":"Supreme Leader Snoke Murdered by Jedi Suspect",
        "date":"18/12/34 ABY",
        "desc":"Rey is captured by the First Order whilst trying to redeem Kylo Ren, and brought before Supreme Leader Snoke aboard his flagship, the Supremacy. Rey murders Snoke, attempting to destroy the First Order. Kylo tragically fails to prevent his leaders death. Instead, he offers here to join him in leadership, however, she declines and escapes after a fight in the throne room. The Resistance fleet is effectively wiped out in the Crait system while fleeing the First Order fleet, but are able to score a victory of their own as Vice Admiral Amilyn Holdo launches a suicide attack which heavily damages the Supremacy and destroys many Star Destroyers"
    },{
        "url":"img/canto-bight.png",
        "title":"Resistence members Arrested on Canto Bight",
        "date":"16/12/34 ABY",
        "desc":"When the Resistance fleet tried to escape from the First Order, the First Order tracked them through hyperspace and remained in pursuit of them, led by Supreme Leader Snoke's Star Destroyer Supremacy. Led by Vice Admiral Amilyn Holdo, the Resistance fleet decided to flee instead of fight. Two resistance members, including former-stormtrooper FN-2187, attempted to break into The Supremacy via a codebreaker. They were successfully apprehended and took to a jail on Canto, failing their mission. FN-2187 and a human female met our spy 'DJ'. While they were heading to the Supremacy, DJ confirmed he could slice through the shield and allow them to break into the Star Dreadnought. With the right encouragement, he led the traitors straight to one of our stormtrooper commanders; Captain Phasma."
    },{
        "url":"img/starkiller.png",
        "title":"Starkiller Successfully destroys Hosnian System",
        "date":"26/05/34 ABY",
        "desc":"The Hosnian Cataclysm, also known as the destruction of Hosnian Prime, the destruction of the Hosnian system, The Hosnian calamity or the Starkiller Incident, was the destruction of the Hosnian system at the hands of the First Order in 34 ABY—thirty years after the Battle of Endor. The event took place during the cold war and marked the annihilation of Courtsilius, Raysho, Hosnian, Cardota, and Hosnian Prime, the capital of the New Republic. Its destruction was carried out by Starkiller Base, a superweapon capable of destroying entire star systems. With the destruction of Hosnian Prime came the destruction of the Galactic Senate and the home fleet of the New Republic Defense Fleet. The massive sub-hyperspace ripple created by the destruction of the system caused the event to be visible in real time around the galaxy, including the planets of Takodana and Vardos. After the destruction of the Hosnian System, the conflict between the First Order and the Resistance escalated into full open warfare."
    }
    
]